app/controllers/ordens_controller.rb

SELECT "ordens".* FROM "ordens"
---
	def index
		@ordens = Ordens.all

SELECT  "ordens".* FROM "ordens" WHERE "ordens"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@ordem = Ordens.find(params[:id])

SELECT  "ordens".* FROM "ordens" WHERE "ordens"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@ordem = Ordens.find(params[:id])

INSERT INTO "ordens" ("nome_do_comprador", "valor_do_item", "quantidade", "descricao_do_item", "nome_do_vendedor", "endereco_do_vendedor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@ordem = Ordens.new(ordens_params)

		if @ordem.save

SELECT  "ordens".* FROM "ordens" WHERE "ordens"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "ordens" SET "nome_do_vendedor" = ?, "updated_at" = ? WHERE "ordens"."id" = ?  [["nome_do_vendedor", "Juca Marlon"], ["updated_at", "2015-04-06 06:01:43.676618"], ["id", 5]]
---
	def update
		@ordem = Ordens.find(params[:id])

		if @ordem.update(ordens_params)

SELECT  "ordens".* FROM "ordens" WHERE "ordens"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "ordens" WHERE "ordens"."id" = ?  [["id", 2]]
---
	def destroy
		@ordem = Ordens.find(params[:id])
		@ordem.destroy